structure Tests =
struct
  val testsAdd : (IntInf.int * IntInf.int) list = [
    (*以下为原始样例*)
    (4000,3334),
    (3,2),
    (123, 937),
    (1024,1024),
    (0,0),
    (1023,1),
    (*以下为自己添加的测试样例*)
    (0,16),
    (11,22),
    (22,33),
    (12,23),
    (5,27),
    (3,1)
  ]

  val testsSub : (IntInf.int * IntInf.int) list = [
    (*以下为原始样例*)
    (4000,3334),
    (3,2),
    (1024, 937),
    (1024,1),
    (884,121),
    (65536,1024),
    (65535,1023),
    (*以下为自己添加的测试样例*)
    (1,1),
    (333,333),
    (11,7),
    (26,21),
    (29,2),
    (15,11),
    (5,1)
  ]

  val testsMul : (IntInf.int * IntInf.int) list = [
    (*以下为原始样例*)
    (4000,3334),
    (3,2),
    (123, 937),
    (0,0),
    (0,1),
    (78758399045,89834590),
    (*以下为自己添加的测试样例*)
    (12306,123338),
    (121,1211),
    (126,131424),
    (121241,111),
    (5,0)
  ]

end
